<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"93eff29d8cdbcb2f64ad905873db68d3521c186196e854acb858b7d4f09ad375","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1228 at https://github.com/cal-itp/data-infra/actions/runs/20381255936","plan_out_hash":"a2347d571b26c4d6937f50699758d8592b48cdb12c4694b39ec647970f4f52de","plan_hash":"ce03ca1ec3cd4cf306fda8ac84f47388d2dc9686f6a4c537c05f96ae7d756ade","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "oc5CiA==" -> (known after apply)
!~      detect_md5hash      = "7ni+M0z/VKztfNfq/PEh5g==" -> "different hash"
!~      generation          = 1766020787836783 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "7ni+M0z/VKztfNfq/PEh5g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1b8GDA==" -> (known after apply)
!~      detect_md5hash      = "cObv1mJvARr4z651DZWzGw==" -> "different hash"
!~      generation          = 1766020789514638 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "cObv1mJvARr4z651DZWzGw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1228](https://github.com/cal-itp/data-infra/actions/runs/20381255936)